#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

To view this run in a browser, visit:
https://app.terraform.io/app/deploymenttheory/terraform-jamfpro-demo/runs/run-VWq4NBNk7CGyWeBa

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.jamfpro_package.jamfpro_package_002_data will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "jamfpro_package" "jamfpro_package_002_data" {
      + id   = "105"
      + name = (known after apply)
    }

  # jamfpro_macos_configuration_profile.jamfpro_macos_configuration_profile_001 will be created
  + resource "jamfpro_macos_configuration_profile" "jamfpro_macos_configuration_profile_001" {
      + distribution_method = "Install Automatically"
      + id                  = (known after apply)
      + level               = "System"
      + name                = "tf-ghatest-macosconfigprofile-accessibility-options"
      + payload             = <<-EOT
            <?xml version="1.0" encoding="UTF-8"?>
            <!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
            <plist version="1">
                <dict>
                    <key>PayloadType</key>
                    <string>Configuration</string>
                    <key>PayloadDisplayName</key>
                    <string>accessibility</string>
                    <key>PayloadDescription</key>
                    <string/>
                    <key>PayloadVersion</key>
                    <integer>1</integer>
                    <key>PayloadEnabled</key>
                    <true/>
                    <key>PayloadRemovalDisallowed</key>
                    <true/>
                    <key>PayloadScope</key>
                    <string>System</string>
                    <key>PayloadContent</key>
                    <array>
                        <dict>
                            <key>PayloadType</key>
                            <string>com.apple.universalaccess</string>
                            <key>PayloadDisplayName</key>
                            <string>Accessibility</string>
                            <key>PayloadDescription</key>
                            <string/>
                            <key>PayloadVersion</key>
                            <integer>1</integer>
                            <key>PayloadEnabled</key>
                            <true/>
                            <key>closeViewScrollWheelToggle</key>
                            <true/>
                            <key>closeViewHotkeysEnabled</key>
                            <true/>
                            <key>closeViewNearPoint</key>
                            <integer>10</integer>
                            <key>closeViewFarPoint</key>
                            <integer>1</integer>
                            <key>closeViewShowPreview</key>
                            <true/>
                            <key>closeViewSmoothImages</key>
                            <true/>
                            <key>whiteOnBlack</key>
                            <true/>
                            <key>grayscale</key>
                            <true/>
                            <key>contrast</key>
                            <integer>0</integer>
                            <key>mouseDriverCursorSize</key>
                            <integer>1</integer>
                            <key>voiceOverOnOffKey</key>
                            <true/>
                            <key>flashScreen</key>
                            <true/>
                            <key>stereoAsMono</key>
                            <true/>
                            <key>stickyKey</key>
                            <true/>
                            <key>stickyKeyBeepOnModifier</key>
                            <true/>
                            <key>stickyKeyShowWindow</key>
                            <true/>
                            <key>slowKey</key>
                            <true/>
                            <key>slowKeyBeepOn</key>
                            <true/>
                            <key>slowKeyDelay</key>
                            <integer>0</integer>
                            <key>mouseDriver</key>
                            <true/>
                            <key>mouseDriverInitialDelay</key>
                            <real>1.0</real>
                            <key>mouseDriverMaxSpeed</key>
                            <integer>3</integer>
                            <key>mouseDriverIgnoreTrackpad</key>
                            <false/>
                        </dict>
                    </array>
                </dict>
            </plist>
        EOT
      + user_removeable     = false
      + uuid                = (known after apply)

      + category {
          + id = -1
        }

      + scope {
          + all_computers      = false
          + all_jss_users      = false
          + computer_group_ids = [
              + 53,
            ]
          + computer_ids       = [
              + 17,
              + 18,
            ]
          + jss_user_group_ids = [
              + 4,
            ]
          + jss_user_ids       = [
              + 4,
            ]

          + exclusions {
              + department_ids = [
                  + 27653,
                ]
            }
        }
    }

  # jamfpro_package.jamfpro_package_002 will be updated in-place
  ~ resource "jamfpro_package" "jamfpro_package_002" {
      - category                      = "No category assigned" -> null
        id                            = "105"
        name                          = "tf-ghatest-package-suspiciouspackage"
        # (18 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + jamfpro_category_001_data_id   = "117"
  + jamfpro_category_001_data_name = "tf-ghatest-category-01"
  ~ jamfpro_package_002_data_name  = "tf-ghatest-package-suspiciouspackage" -> (known after apply)

Run status: planned and saved (confirmable)
Workspace is unlocked

```

</details>

*Pusher: @ShocOne, Action: `push`, Working Directory: `workload/terraform/jamfpro`, Workflow: `Create terraform plan`*